lib/existing_jmeter_script.yml
execution:
- iterations: 50
  concurrency: 10
  scenario: with_script

scenarios:
  with_script:
    script: ./LambdaConcurrencyLimits.jmx

modules:
  jmeter:
    path: /home/ec2-user/apache-jmeter-5.6.3/bin/jmeter
    properties:
      APIURL: %APIURL%
    
reporting:
- module: passfail
  criteria:
  - "avg-rt>150ms for 10s, continue as failed"
  - "fail>50% for 10s, stop as failed"