lib/existing_jmeter_script.yml
execution:
- iterations: 3
  #concurrency: 1
  #concurrency: 10
  #concurrency: 100
  concurrency: 1000
  #concurrency: 10000
  #concurrency: 100000
  ramp-up: 20s
  scenario: with_script

scenarios:
  loop: 3
  with_script:
    script: ./LambdaConcurrencyLimits.jmx

modules:
  jmeter:
    path: /home/ec2-user/apache-jmeter-5.6.3/bin/jmeter
    properties:
      APIURL: %APIURL%
    
reporting:
- module: final-stats
  failed-labels: true
- module: passfail
  criteria:
  - "failures>90% for 5s, stop as failed"