lib/existing_jmeter_script.yml
execution:
- scenario: with_script
  #concurrency: 1
  #concurrency: 10
  #concurrency: 100
  concurrency: 1000
  #concurrency: 10000
  #concurrency: 100000
  #ramp-up: 20s

scenarios:
  with_script:
    script: ./LambdaConcurrencyLimits.jmx
    modifications:
      enable:
      - ThreadGroup10
      disable:
      - ThreadGroup100
      - ThreadGroup1K

modules:
  jmeter:
    path: /home/ec2-user/apache-jmeter-5.6.3/bin/jmeter
    properties:
      APIURL: %APIURL%